controllers/MahasiswaController.php

INSERT INTO `mahasiswa` (`nim`, `nama`, `jekel`, `tgllahir`, `id_jurusan`, `id_prodi`, `email`, `alamat`) VALUES ('1911082006', 'Andi Irham', 'L', '2021-06-30', 1, 1, 'andi.irhamm@gmail.com', 'Unand')
---
    public function actionCreate()
    {
        $model = new Mahasiswa();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `mahasiswa` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Mahasiswa::findOne($id)) !== null) {