models/Jurusan.php

    public static function getJurusan()
    {
        return Self::find()->select(['NamaJurusan', 'id'])->indexBy('id')->column();
---
SELECT `NamaJurusan`, `id` FROM `jurusan`